In [1]:
import pandas as pd
import numpy as np

In [2]:
dias = pd.date_range(start = '20190101', periods = 12)

In [3]:
dias

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10', '2019-01-11', '2019-01-12'],
              dtype='datetime64[ns]', freq='D')

In [4]:
Pessoa = ['George', 'Victor', 'Lucas']

In [27]:
np.random.choice(Pessoa)

'Victor'

In [32]:
Nome = []
Gasto = []
for i in range(12):
    Nome.append(np.random.choice(Pessoa))
    Gasto.append(np.round(np.random.rand() * 100, 2))
Nome

['Victor',
 'George',
 'Lucas',
 'Lucas',
 'George',
 'Lucas',
 'George',
 'Victor',
 'Victor',
 'Victor',
 'George',
 'Victor']

In [33]:
Gasto

[21.97, 4.18, 4.7, 79.84, 39.52, 66.72, 92.67, 63.9, 5.71, 14.51, 38.14, 5.46]

In [34]:
df = pd.DataFrame({'Dia': dias, 'Nome' : Nome, 'Gasto' : Gasto})

In [35]:
df

          Dia    Nome  Gasto
0  2019-01-01  Victor  21.97
1  2019-01-02  George   4.18
2  2019-01-03   Lucas   4.70
3  2019-01-04   Lucas  79.84
4  2019-01-05  George  39.52
5  2019-01-06   Lucas  66.72
6  2019-01-07  George  92.67
7  2019-01-08  Victor  63.90
8  2019-01-09  Victor   5.71
9  2019-01-10  Victor  14.51
10 2019-01-11  George  38.14
11 2019-01-12  Victor   5.46

In [38]:
df.pivot(index = 'Dia', columns = 'Nome', values = 'Gasto')

Nome        George  Lucas  Victor
Dia
2019-01-01     NaN    NaN   21.97
2019-01-02    4.18    NaN     NaN
2019-01-03     NaN   4.70     NaN
2019-01-04     NaN  79.84     NaN
2019-01-05   39.52    NaN     NaN
2019-01-06     NaN  66.72     NaN
2019-01-07   92.67    NaN     NaN
2019-01-08     NaN    NaN   63.90
2019-01-09     NaN    NaN    5.71
2019-01-10     NaN    NaN   14.51
2019-01-11   38.14    NaN     NaN
2019-01-12     NaN    NaN    5.46